<template>
    <div id="help-page" class="help-android">
        <h1>更新类型 的说明</h1>
        <h2>更新类型</h2>
        <ul>
            <li><p><a href="#type-1">强制更新</a></p></li>
            <li><p><a href="#type-2">一般更新</a></p></li>
            <li><p><a href="#type-3">静默更新</a></p></li>
            <li><p><a href="#type-4">可忽略更新</a></p></li>
            <li><p><a href="#type-5">静默可忽略更新</a></p></li>
        </ul>
        <h2 id="type-1">强制更新</h2>
        <p>顾名思义，弹出更新后就必须更新，否则无法进行任何操作，退出应用再进来依然是这样。</p>
        <h2 id="type-2">一般更新</h2>
        <p>每次APP启动都会弹出更新提示，但是更新对话框可以点击关闭，然后用户可以继续使用。</p>
        <p>用户下次再次启动APP，更新对话框依然弹出来提示用户更新，用户依然可以关闭继续使用。</p>
        <h2 id="type-3">静默更新</h2>
        <p>APP检测到更新信息后，判断如果是WI-FI情况下，会在后台下载好Apk文件，下次用户再启动APP的时候会提示用户直接安装新版APP。</p>
        <p>用户可以关闭更新提示框继续使用，但是下次再打开依然会提示用户安装新版APP。</p>
        <h2 id="type-4">可忽略更新</h2>
        <p>顾名思义，用户点击忽略后，不在对该版本进行提示，直到下一次版本更新才会重新提示版本更新。</p>
        <h2 id="type-5">静默可忽略更新</h2>
        <p>检测到新版本后先下载，下载完成之后弹更新对话框，随后逻辑同可忽略更新</p>
        <blockquote>
            <p>对于 iOS AppStore 的更新来说：静默更新、可忽略更新、静默可忽略更新都<code>只弹一次提示更新</code>的对话框</p>
        </blockquote>
        <div class="end"></div>
    </div>
</template>
